src/notes/aws-jira-dc.org
#+TITLE: Performance and scale testing of your App on Jira DC
#+OPTIONS: num:nil, html-postamble:nil, 
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/main.css" />

* Introduction
  If you have apps listed on Atlassian Marketplace then you might have
  come across this regulatory requirement from Atlassian that your
  applications must perform as per a set criteria[fn:1]. This is good
  for customers because if an app is in the marketplace then they can
  be sure that it meets the performance and scalability
  benchmarks. They can safely rely on Atlassian's judgement. And it is
  good for the app providers also because it boosts their confidence
  in their own app. Clearing the benchmark is not a small feat. Test
  data is huge. 1 million issues, 2 million attachments, 6 million
  comments. Check out the full set on the developer website[fn:4].

  We have two apps on the marketplace - (1) RMsis - Requirement
  Management for Jira[fn:2] (2) LXP - Links Explorer Traceability &
  Hierarchy[fn:3]. Both of them are available for Jira Data Center and
  earstwhile Jira Server edition. LXP is available on the cloud as
  well. I have gone through the performance and scale test for one
  app. Hence I am writing down my experience here. It will definitely
  be useful when I go for another round for another app.

  This article is not to scare you about the bechmarking test but to
  encourage you to go for it. Atlassian has done a great job of
  documenting the steps[fn:4]. This post will serve as an add-on to
  get you started. I'll describe the concepts involved.

  A well known fact is that the Jira Data Centre or Jira DC is
  designed to serve a lot more concurrent users under enterprise load
  than you would normally do with server edition. Basically, you can
  add high performing nodes as your usage goes beyond a limit. You can
  start with single node and ramp-up the hardware as the situation
  demands. Atlassian has to make sure that the apps also perform and
  scale well along with Jira. Hence the tests.

  To list your apps on the Atlassian Marketplace[fn:5], you are
  required to test the apps on 1-node, 2-node and 4-node Jira DC
  environment. And submit the test results to Atlassian. The math goes
  like this - 4 machines (max) to install Jira DC, one machine to host
  database, and one for executing the test-cases. This last one could
  be your laptop if your whole setup is local i.e. within the
  premise. In total, you will require 6 machines.

  Next three sections are dedicated to the high-level steps to
  complete this exercise. For detailed instructions inside each step,
  I recommend the documentation published by Atlassian. I’ll give
  references wherever necessary. Next sections will cover:

  1. Setting up the hardware
  2. Setup Jira DC and your app
  3. Develop and execute the tests

* Setup the hardware
  If you are working in a large enterprise with own cluster then
  probably you will have to go through some administrative tickets to
  provision the hardware required for the tests. Other option is to
  quickly launch virtual machines on Amazon AWS cloud and delete when
  you are done. In this article, I’ll talk about the latter.

  Atlassian and AWS have jointly worked on some open-source
  quick-start tools that can be readily used for our
  purpose[fn:6][fn:7]. You can either create the infrastructure on AWS
  manually or you may use the quickstart tools to automatically create
  the required infrastructure. /Remember that AWS infrastructure will
  incur some cost/.

  Although the quick-start help document is big, it is a must read if
  you really want to understand what is happening under the hood. You
  will appreciate the power of automation after going through it. It
  has some tips to customize the infrastructure as well; especially to
  reduce some cost. But in my experience, the whole exercise took less
  than a single working day if you stretch a bit, so you will not save
  much even if you customize it. I would recommend that you use the
  quick-start tool as-it-is. And save time instead of cost. In case
  you follow my recommendation then you just have to clone the
  =quickstart-atlassian-jira= git-repository[fn:7]. And copy it to a
  dedicated AWS S3 Bucket. You may push it in any other bucket but it
  is better to keep it isolated for security reasons as well. On a
  command-line, you will do just this (I am assuming you have
  =aws-cli=[fn:8] and =git=[fn:9] installed):

  #+begin_src shell
    $ git clone --recurse-submodules \
      https://github.com/aws-quickstart/quickstart-atlassian-jira.git

    $ aws s3 mb s3://<BUCKET_NAME> --region <AWS_REGION>

    $ aws s3 cp quickstart-atlassian-jira \
      s3://<BUCKET_NAME>/quickstart-atlassian-jira \
      --recursive --acl public-read
  #+end_src

  With public access to the above directory inside AWS S3, you can now
  launch a complete =AWS CloudFormation= without actually thinking
  about the network design, hardware setup, database setup, Jira
  Software installation. The steps are simple:

  1. Go to AWS CloudFormation[fn:10]
  2. Click =Create stack=
  3. Provide Amazon S3 URL of the
     =quickstart-jira-dc-with-vpc.template.yaml= file in the above
     bucket. (https://BUCKET_NAME.s3.amazonaws.com/quickstart-atlassian-jira/templates/quickstart-jira-dc-with-vpc.template.yaml)
  4. Follow the wizard

  I have collapsed multiple things in the fourth step. Basically, in
  the wizard, you will have to select the type of AWS virtual machines
  that you want to use for Jira DC and PostgreSQL installation and
  setup database passwords. Atlassian advises you to create a
  development setup first; with smaller AWS instances. t3-medium is
  sufficient for development. I think you should consider that
  advice. On a development setup, when you pass 95% test-cases then go
  for the actual tests with the full-fledged enterprise class data-set
  provided by Atlassian.
  
