docs/notes/aws-jira-dc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
  <head>
    <!-- 2025-03-06 Thu 23:21 -->
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>Performance and scale testing of your App on Jira DC</title>
    <meta name="author" content="Pankaj Jangid" />
    <meta name="generator" content="Org Mode" />
    <link rel="stylesheet" type="text/css" href="../css/main.css" />
  </head>
  <body>
    <div id="content" class="content">
      <h1 class="title">Performance and scale testing of your App on Jira DC</h1>
      <div id="outline-container-org4d98785" class="outline-2">
	<h2 id="org4d98785">Introduction</h2>
	<div class="outline-text-2" id="text-org4d98785">
	  <p>
	    If you have apps listed on Atlassian Marketplace then you might have
	    come across this regulatory requirement from Atlassian that your
	    applications must perform as per a set criteria<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>. This is good
	    for customers because if an app is in the marketplace then they can
	    be sure that it meets the performance and scalability
	    benchmarks. They can safely rely on Atlassian's judgement. And it is
	    good for the app providers also because it boosts their confidence
	    in their own app. Clearing the benchmark is not a small feat. Test
	    data is huge. 1 million issues, 2 million attachments, 6 million
	    comments. Check out the full set on the developer website<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
	  </p>

	  <p>
	    We have two apps on the marketplace - (1) RMsis - Requirement
	    Management for Jira<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup> (2) LXP - Links Explorer Traceability &amp;
	    Hierarchy<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>. Both of them are available for Jira Data Center and
	    earstwhile Jira Server edition. LXP is available on the cloud as
	    well. I have gone through the performance and scale test for one
	    app. Hence I am writing down my experience here. It will definitely
	    be useful when I go for another round for another app.
	  </p>

	  <p>
	    This article is not to scare you about the bechmarking test but to
	    encourage you to go for it. Atlassian has done a great job of
	    documenting the steps<sup><a id="fnr.2.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>. This post will serve as an add-on to
	    get you started. I'll describe the concepts involved.
	  </p>

	  <p>
	    A well known fact is that the Jira Data Centre or Jira DC is
	    designed to serve a lot more concurrent users under enterprise load
	    than you would normally do with server edition. Basically, you can
	    add high performing nodes as your usage goes beyond a limit. You can
	    start with single node and ramp-up the hardware as the situation
	    demands. Atlassian has to make sure that the apps also perform and
	    scale well along with Jira. Hence the tests.
	  </p>

	  <p>
	    To list your apps on the Atlassian Marketplace<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>, you are
	    required to test the apps on 1-node, 2-node and 4-node Jira DC
	    environment. And submit the test results to Atlassian. The math goes
	    like this - 4 machines (max) to install Jira DC, one machine to host
	    database, and one for executing the test-cases. This last one could
	    be your laptop if your whole setup is local i.e. within the
	    premise. In total, you will require 6 machines.
	  </p>

	  <p>
	    Next three sections are dedicated to the high-level steps to
	    complete this exercise. For detailed instructions inside each step,
	    I recommend the documentation published by Atlassian. I’ll give
	    references wherever necessary. Next sections will cover:
	  </p>

	  <ol class="org-ol">
	    <li>Setting up the hardware</li>
	    <li>Setup Jira DC and your app</li>
	    <li>Develop and execute the tests</li>
	  </ol>
	</div>
      </div>
      <div id="outline-container-orgd70dd6b" class="outline-2">
	<h2 id="orgd70dd6b">Setup the hardware</h2>
	<div class="outline-text-2" id="text-orgd70dd6b">
	  <p>
	    If you are working in a large enterprise with own cluster then
	    probably you will have to go through some administrative tickets to
	    provision the hardware required for the tests. Other option is to
	    quickly launch virtual machines on Amazon AWS cloud and delete when
	    you are done. In this article, I’ll talk about the latter.
	  </p>

	  <p>
	    Atlassian and AWS have jointly worked on some open-source
	    quick-start tools that can be readily used for our
	    purpose<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup><sup>, </sup><sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup>. You can either create the infrastructure on AWS
	    manually or you may use the quickstart tools to automatically create
	    the required infrastructure. <i>Remember that AWS infrastructure will
	      incur some cost</i>.
	  </p>

	  <p>
	    Although the quick-start help document is big, it is a must read if
	    you really want to understand what is happening under the hood. You
	    will appreciate the power of automation after going through it. It
	    has some tips to customize the infrastructure as well; especially to
	    reduce some cost. But in my experience, the whole exercise took less
	    than a single working day if you stretch a bit, so you will not save
	    much even if you customize it. I would recommend that you use the
	    quick-start tool as-it-is. And save time instead of cost. In case
	    you follow my recommendation then you just have to clone the
	    <code>quickstart-atlassian-jira</code> git-repository<sup><a id="fnr.7.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup>. And copy it to a
	    dedicated AWS S3 Bucket. You may push it in any other bucket but it
	    is better to keep it isolated for security reasons as well. On a
	    command-line, you will do just this (I am assuming you have
	    <code>aws-cli</code><sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup> and <code>git</code><sup><a id="fnr.9" class="footref" href="#fn.9" role="doc-backlink">9</a></sup> installed):
	  </p>

	  <div class="org-src-container">
	    <pre class="src src-shell">$ git clone --recurse-submodules \
	      https://github.com/aws-quickstart/quickstart-atlassian-jira.git

	      $ aws s3 mb s3://&lt;BUCKET_NAME&gt; --region &lt;AWS_REGION&gt;

	      $ aws s3 cp quickstart-atlassian-jira \
	      s3://&lt;BUCKET_NAME&gt;/quickstart-atlassian-jira \
	      --recursive --acl public-read
	    </pre>
	  </div>

	  <p>
	    With public access to the above directory inside AWS S3, you can now
	    launch a complete <code>AWS CloudFormation</code> without actually thinking
	    about the network design, hardware setup, database setup, Jira
	    Software installation. The steps are simple:
	  </p>

	  <ol class="org-ol">
	    <li>Go to AWS CloudFormation<sup><a id="fnr.10" class="footref" href="#fn.10" role="doc-backlink">10</a></sup></li>
	    <li>Click <code>Create stack</code></li>
	    <li>Provide Amazon S3 URL of the
	      <code>quickstart-jira-dc-with-vpc.template.yaml</code> file in the above
	      bucket. (<a href="https://bucket_name.s3.amazonaws.com/quickstart-atlassian-jira/templates/quickstart-jira-dc-with-vpc.template.yaml">https://bucket_name.s3.amazonaws.com/quickstart-atlassian-jira/templates/quickstart-jira-dc-with-vpc.template.yaml</a>)</li>
	    <li>Follow the wizard</li>
	  </ol>

	  <p>
	    I have collapsed multiple things in the fourth step. Basically, in
	    the wizard, you will have to select the type of AWS virtual machines
	    that you want to use for Jira DC and PostgreSQL installation and
	    setup database passwords. Atlassian advises you to create a
	    development setup first; with smaller AWS instances. t3-medium is
	    sufficient for development. I think you should consider that
	    advice. On a development setup, when you pass 95% test-cases then go
	    for the actual tests with the full-fledged enterprise class data-set
	    provided by Atlassian.
	  </p>
	</div>
      </div>
