docs/notes/aws-jira-dc.html
      <div id="outline-container-org66877ef" class="outline-2">
	<h2 id="org66877ef">Setup Jira Software Data Center and your App</h2>
	<div class="outline-text-2" id="text-org66877ef">
	  <p>
	    One of the advantages of using the quick-start setup is that you
	    don't have to install Jira DC yourself. The declarative way in which
	    it is done is really nice and it scales just like that. You can
	    start with just 1-node and based on your load graph of the day or
	    may be a week, you can schedule adding and reducing nodes. The setup
	    needs to be configured only once. And the setup is also easy. But in
	    this article we are talking about the scale and performance
	    testing. So all this scaling will happen in a controlled way. We'll
	    increase nodes one-by-one and save the test results for each
	    scenario.
	  </p>

	  <p>
	    After your first instance is up. Just copy the load-balancer url and
	    open it in your browser. It will take you to the initial Jira setup
	    screen where you specify the site-title, administrator email-id
	    etc. Once this is done, your single-node setup is ready to
	    use.
	  </p>

	  <p>
	    Jira DC setup for development and actual enterprise testing are not
	    different. The only difference is in the infrastructure. You don't
	    need too many nodes at the time of development and you don't need
	    bigger machines. A t3-medium sized single node is sufficient.
	  </p>

	  <p>
	    When testing on the large data-set, you are required to test on
	    multiple nodes as well. To add more nodes to the above setup:
	  </p>

	  <ol class="org-ol">
	    <li>Goto AWS CloudFormation console.</li>
	    <li>Select the stack and choose update-stack from actions.</li>
	    <li>Click next and change the minimum and maximum number of cluster
	      nodes. Done.</li>
	  </ol>

	  <p>
	    You are done. In few minutes, your new node will be up. And for the
	    tests to work you will need to synchronise Jira search index on all
	    the nodes. Data Center App Performance Toolkit<sup><a id="fnr.11" class="footref" href="#fn.11" role="doc-backlink">11</a></sup> has a
	    shell-script to synchronise the search index. You are required to do
	    this every time you add a new node.
	  </p>

	  <p>
	    Let us now move on to see what are the scenarios that Atlassian
	    wants us to test.
	  </p>
	</div>
      </div>
      <div id="outline-container-org2b2c1eb" class="outline-2">
	<h2 id="org2b2c1eb">Develop and execute test-cases</h2>
	<div class="outline-text-2" id="text-org2b2c1eb">
	  <p>
	    We are required to submit test results for five scenarios:
	  </p>

	  <ol class="org-ol">
	    <li>1-node, without app</li>
	    <li>1-node, with app</li>
	    <li>1-node, with app, with app-specific tests included</li>
	    <li>2-node, with app, with app-specific tests included</li>
	    <li>4-node, with app, with app-specific tests included</li>
	  </ol>

	  <p>
	    Once your 1-node setup is up and running, import the large data-set
	    provided by Atlassian. This is a huge data-set, as I have mentioned
	    earlier. If the system is performing well with this data-set then
	    the probability is rare that it will face any performance related
	    issues in the customer's deployment.
	  </p>

	  <p>
	    Atlassian has prepared a test suite which has large number of tests
	    that simulate 21000 user (200 concurrent), 54500 actions per
	    hour<sup><a id="fnr.11.11" class="footref" href="#fn.11" role="doc-backlink">11</a></sup>. Test duration for single run is ~45 minutes. You are
	    required to add a few test cases for your app as well. If your app
	    just adds some UI elements then adding selenium tests is all that
	    you need. But if the app adds some APIs then add a few Jmeter calls
	    as well for each API. Code examples are given in the Data Center App
	    Performance Toolkit<sup><a id="fnr.11.11" class="footref" href="#fn.11" role="doc-backlink">11</a></sup>.
	  </p>

	  <p>
	    As suggested by Atlassian, do not jump directly to the final
	    testing. First launch a development environment on AWS, with smaller
	    instances, and then build your app-specific test cases on a separate
	    branch in the git repository. Simplest way is to fork the
	    Atlassian's repository and clone from there. Then create a separate
	    branch for adding app-specific tests. If you have more than one app
	    in the Atlassian Marketplace<sup><a id="fnr.5.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup> then create a branch for each
	    app. Push all your changes to your remote repository.
	  </p>

	  <p>
	    In the development scenario, you should not import the full
	    data-set. Instead create 2 test projects with five-five issues in
	    each. That is sufficient for development. Also you can run the tests
	    directly from your own laptop. You need to set some variables in
	    <code>dc-app-performance-toolkit/app/jira.yml</code> to let it know the URL of
	    your Jira DC installation. Once the single-node Jira DC development
	    setup is ready in AWS, just run the performance toolkit.
	  </p>

	  <div class="org-src-container">
	    <pre class="src src-shell">$ bzt jira.yml
	    </pre>
	  </div>

	  <p>
	    The results are saved in
	    <code>dc-app-performance-toolkit/app/results/jira/YY-MM-DD-hh-mm-ss</code>
	    directory. Check <code>results_summary.log</code>. Do not proceed with the full
	    data-set tests until you have all the actions with 95+% success
	    rate.
	  </p>

	  <p>
	    Once you are done with test developments, launch the full
	    infrastructure with 1-node. Then increase nodes as specified in the
	    full document<sup><a id="fnr.12" class="footref" href="#fn.12" role="doc-backlink">12</a></sup>. It is recommended that you fire the test suite
	    from a virtual machine on AWS, instead of your
	    laptop/workstation. Otherwise things like power or network outage
	    may affect the execution and you will have to start over again. Each
	    run takes a long time ~45 minutes.
	  </p>

	  <p>
	    Once you single-node setup is ready, you are required to upload the
	    full data-set. This has three steps:
	  </p>

	  <ol class="org-ol">
	    <li><code>populate_db.sh</code> (~1 hour)</li>
	    <li><code>upload_attachments.sh</code> (~2 hours)</li>
	    <li>Re-index from Jira Administration screen (~30 minutes)</li>
	  </ol>

	  <p>
	    On the AWS execution environment (the VM that we fired for running
	    tests), to save you from lots of installations, Atlassian has
	    created a docker image. You can directly fire the tests from that
	    docker image. So the only installation that you need is docker. In
	    short:
	  </p>

	  <ol class="org-ol">
	    <li>Launch an Ubuntu 18.03 LTS VM</li>
	    <li>Install docker</li>
	    <li>Checkout <i>your</i> dc test repository</li>
	    <li><p>
		Instead of installing and running bzt, just launch the docker
		container
	      </p>
	      <div class="org-src-container">
		<pre class="src src-shell">$ docker run --shm-size=4g -v "$PWD:/dc-app-performance-toolkit" \
		  atlassian/dcapt jira.yml
		</pre>
	    </div></li>
	  </ol>

	  <p>
	    Again the results are save in
	    <code>dc-app-performance-toolkit/app/results/jira/YY-MM-DD-hh-mm-ss</code>. You
	    will need to do this five times, once for each scenario.
	  </p>
	</div>
      </div>
      <div id="outline-container-orgbd986aa" class="outline-2">
	<h2 id="orgbd986aa">Conclusion</h2>
	<div class="outline-text-2" id="text-orgbd986aa">
	  <p>
	    It took me 10 hours to complete the full exercise; with some breaks,
	    of course. But the whole thing was worth it. It gives me confidence
	    that our apps will perform really well in the production environment
	    of our customers. Nothing is more satisfying than a happy customer.
	  </p>

	  <p>
	    In case you need any help in the above setup then you may join the
	    Slack Community<sup><a id="fnr.13" class="footref" href="#fn.13" role="doc-backlink">13</a></sup> and ask there as well. The community is
	    really active and there is dedicated staff from Atlassian to help
	    you out.
	  </p>

	  <p>
	    Enjoy testing!
	  </p>
	</div>
      </div>
