src/notes/aws-jira-dc.org
* Footnotes

[fn:13] Slack Community for Atlassian Performance Tools -
https://atlassian-performance.slack.com

[fn:12] Data Center App Performance Toolkit User Guide For Jira -
https://developer.atlassian.com/platform/marketplace/dc-apps-performance-toolkit-user-guide-jira/

[fn:11] Data Center App Performance Toolkit -
https://github.com/atlassian/dc-app-performance-toolkit

[fn:10] AWS CloudFormation -
https://console.aws.amazon.com/cloudformation

[fn:9] Git -
https://git-scm.com/

[fn:8] AWS CLI -
https://aws.amazon.com/cli/

[fn:7] Jira DC on AWS - Quick Start Reference Deployment [Github Repo] -
https://github.com/aws-quickstart/quickstart-atlassian-jira

[fn:6] Jira DC on AWS - Quick Start Reference Deployment -
https://aws-quickstart.github.io/quickstart-atlassian-jira/

[fn:5] Atlassian Marketplace -
https://marketplace.atlassian.com/

[fn:4] Testing your app on a large DC -
https://developer.atlassian.com/platform/marketplace/testing-your-app-with-a-large-data-set/

[fn:3] LXP - Links Explorer Traceability & Hierarchy -
https://optimizory.com/products/lxp.

[fn:2] RMsis - Requirement Management for Jira -
https://optimizory.com/products/rmsis.

[fn:1] Performance and scale testing your Data Center app -
https://developer.atlassian.com/platform/marketplace/dc-apps-performance-and-scale-testing/#requirements.
