docs/notes/aws-jira-dc.html
      <div id="footnotes">
	<h2 class="footnotes">Footnotes: </h2>
	<div id="text-footnotes">

	  <div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
		Performance and scale testing your Data Center app -
		<a href="https://developer.atlassian.com/platform/marketplace/dc-apps-performance-and-scale-testing/#requirements">https://developer.atlassian.com/platform/marketplace/dc-apps-performance-and-scale-testing/#requirements</a>.
	  </p></div></div>

	  <div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
		Testing your app on a large DC -
		<a href="https://developer.atlassian.com/platform/marketplace/testing-your-app-with-a-large-data-set/">https://developer.atlassian.com/platform/marketplace/testing-your-app-with-a-large-data-set/</a>
	  </p></div></div>

	  <div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
		RMsis - Requirement Management for Jira -
		<a href="https://optimizory.com/products/rmsis">https://optimizory.com/products/rmsis</a>.
	  </p></div></div>

	  <div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
		LXP - Links Explorer Traceability &amp; Hierarchy -
		<a href="https://optimizory.com/products/lxp">https://optimizory.com/products/lxp</a>.
	  </p></div></div>

	  <div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5" role="doc-backlink">5</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
		Atlassian Marketplace -
		<a href="https://marketplace.atlassian.com/">https://marketplace.atlassian.com/</a>
	  </p></div></div>

	  <div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6" role="doc-backlink">6</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
		Jira DC on AWS - Quick Start Reference Deployment -
		<a href="https://aws-quickstart.github.io/quickstart-atlassian-jira/">https://aws-quickstart.github.io/quickstart-atlassian-jira/</a>
	  </p></div></div>

	  <div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7" role="doc-backlink">7</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
		Jira DC on AWS - Quick Start Reference Deployment [Github Repo] -
		<a href="https://github.com/aws-quickstart/quickstart-atlassian-jira">https://github.com/aws-quickstart/quickstart-atlassian-jira</a>
	  </p></div></div>

	  <div class="footdef"><sup><a id="fn.8" class="footnum" href="#fnr.8" role="doc-backlink">8</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
		AWS CLI -
		<a href="https://aws.amazon.com/cli/">https://aws.amazon.com/cli/</a>
	  </p></div></div>

	  <div class="footdef"><sup><a id="fn.9" class="footnum" href="#fnr.9" role="doc-backlink">9</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
		Git -
		<a href="https://git-scm.com/">https://git-scm.com/</a>
	  </p></div></div>

	  <div class="footdef"><sup><a id="fn.10" class="footnum" href="#fnr.10" role="doc-backlink">10</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
		AWS CloudFormation -
		<a href="https://console.aws.amazon.com/cloudformation">https://console.aws.amazon.com/cloudformation</a>
	  </p></div></div>

	  <div class="footdef"><sup><a id="fn.11" class="footnum" href="#fnr.11" role="doc-backlink">11</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
		Data Center App Performance Toolkit -
		<a href="https://github.com/atlassian/dc-app-performance-toolkit">https://github.com/atlassian/dc-app-performance-toolkit</a>
	  </p></div></div>

	  <div class="footdef"><sup><a id="fn.12" class="footnum" href="#fnr.12" role="doc-backlink">12</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
		Data Center App Performance Toolkit User Guide For Jira -
		<a href="https://developer.atlassian.com/platform/marketplace/dc-apps-performance-toolkit-user-guide-jira/">https://developer.atlassian.com/platform/marketplace/dc-apps-performance-toolkit-user-guide-jira/</a>
	  </p></div></div>

	  <div class="footdef"><sup><a id="fn.13" class="footnum" href="#fnr.13" role="doc-backlink">13</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
		Slack Community for Atlassian Performance Tools -
		<a href="https://atlassian-performance.slack.com">https://atlassian-performance.slack.com</a>
	  </p></div></div>


	</div>
    </div></div>
    <div id="postamble" class="status">
      <p class="creator">Created with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1.50 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
    </div>
  </body>
</html>
